_org_posts/_posts/2020-10-02-English-Listening.org
#+HTML: ---
#+HTML: title: 20년 영어듣기
#+HTML: tags: StudyEnglish
#+HTML: toc: true
#+HTML: toc_sticky: true
#+HTML: ---

* Oct
** 5 things that help me avoid procrastination
 + https://www.youtube.com/watch?v=cRpQOXV2cFg
** Developers vs. App Store: Apple's Fights, Explained | WSJ
 + https://www.youtube.com/watch?v=JZXWf65yhGM
** 3 Big Mistakes in Your English Listening | Go Natural English
 + https://www.youtube.com/watch?v=BlCBnY3Y-jw
** Winter Is Coming: Restaurant Owners Worry About Business Impact | WSJ
 + https://www.youtube.com/watch?v=HZDROyavRwg&t=69s
** Who is leading in renewable ennergy? | CNBC Explains
 + https://www.youtube.com/watch?v=fyqDC_AKVgE
** Why Tech Firms Flock to Expensive Cities | WSJ
 + https://www.youtube.com/watch?v=50vRNNGqlp4
