_posts/2020-10-02-English-Listening.html
---
layout: post
title: 20년 영어듣기
tags: StudyEnglish
---

<div id="outline-container-orgecb3513" class="outline-2">
<h2 id="orgecb3513">Oct</h2>
<div class="outline-text-2" id="text-orgecb3513">
</div>
<div id="outline-container-org4f3d42d" class="outline-3">
<h3 id="org4f3d42d">5 things that help me avoid procrastination</h3>
<div class="outline-text-3" id="text-org4f3d42d">
<ul class="org-ul">
<li><a href="https://www.youtube.com/watch?v=cRpQOXV2cFg">https://www.youtube.com/watch?v=cRpQOXV2cFg</a></li>
</ul>
</div>
</div>
<div id="outline-container-org1c41b77" class="outline-3">
<h3 id="org1c41b77">Developers vs. App Store: Apple's Fights, Explained | WSJ</h3>
<div class="outline-text-3" id="text-org1c41b77">
<ul class="org-ul">
<li><a href="https://www.youtube.com/watch?v=JZXWf65yhGM">https://www.youtube.com/watch?v=JZXWf65yhGM</a></li>
</ul>
</div>
</div>
<div id="outline-container-orga609799" class="outline-3">
<h3 id="orga609799">3 Big Mistakes in Your English Listening | Go Natural English</h3>
<div class="outline-text-3" id="text-orga609799">
<ul class="org-ul">
<li><a href="https://www.youtube.com/watch?v=BlCBnY3Y-jw">https://www.youtube.com/watch?v=BlCBnY3Y-jw</a></li>
</ul>
</div>
</div>
<div id="outline-container-orgd9b2350" class="outline-3">
<h3 id="orgd9b2350">Winter Is Coming: Restaurant Owners Worry About Business Impact | WSJ</h3>
<div class="outline-text-3" id="text-orgd9b2350">
<ul class="org-ul">
<li><a href="https://www.youtube.com/watch?v=HZDROyavRwg&amp;t=69s">https://www.youtube.com/watch?v=HZDROyavRwg&amp;t=69s</a></li>
</ul>
</div>
</div>
<div id="outline-container-orgf1fb3bb" class="outline-3">
<h3 id="orgf1fb3bb">Who is leading in renewable ennergy? | CNBC Explains</h3>
<div class="outline-text-3" id="text-orgf1fb3bb">
<ul class="org-ul">
<li><a href="https://www.youtube.com/watch?v=fyqDC_AKVgE">https://www.youtube.com/watch?v=fyqDC_AKVgE</a></li>
</ul>
</div>
</div>
<div id="outline-container-orgadda425" class="outline-3">
<h3 id="orgadda425">Why Tech Firms Flock to Expensive Cities | WSJ</h3>
<div class="outline-text-3" id="text-orgadda425">
<ul class="org-ul">
<li><a href="https://www.youtube.com/watch?v=50vRNNGqlp4">https://www.youtube.com/watch?v=50vRNNGqlp4</a></li>
</ul>
</div>
</div>
</div>
